backend/app/controllers/blogs_controller.rb

SELECT `blogs`.* FROM `blogs`
---
  def index
    blogs = Blog.all

SELECT `blogs`.* FROM `blogs` WHERE `blogs`.`id` = 1 LIMIT 1
---
  def show
    blog = Blog.find(params[:id])

INSERT INTO `blogs` (`title`, `contents`, `created_at`, `updated_at`) VALUES ('', 'あああああああああ', '2023-07-12 02:16:03.415569', '2023-07-12 02:16:03.415569')
---
  def create
    Blog.create(blog_params)